{
  "Deepika Padukone": [
    "Deepika was originally supposed to make her debut in Priydarshan's Pirate about musical piracy. She was to be cast as a member of a rock band. That film never got made.",
    "She was meant to make her debut with Sanjay Leela Bhansali's 'Saawariya'. But Bhansali decided to go with the 'Anil Kapoor's Daughter & Rishi Kapoor's Son' formula and signed Sonam and Ranbir instead. Ultimately, Deepika's debut film released on the same day as 'Saawariya', thereby creating an ongoing rivalry between the two ladies that hasn't gone away as yet.",
    "Deepika played a double role in her first film, 'Om Shanti Om' and then again in the disastrous 'Chandni Chowk To China' opposite Akshay Kumar. Two double roles in the first year of her career. Not bad! By the way, Akshay was not lucky for either Deepika (Chandni Chowk to China) or Farah Khan (Tees Maar Khan).",
    "Deepika has a sister Anisha who is a golf champ. Deepika loves outdoor sports. If Deepika had not been an actress she would have been a badminton player just like her champ-dad Prakash Padukone whom she hero-worships.",
    "Before she came into the film industry Deepika was in a relationship with wannabe actor Nihar Pandya whom she left under very dramatic circumstances when she got involved with Ranbir Kapoor. In fact, Pandya was to star in a film based on his relationship with Deepika. Luckily that idea remained unfulfilled.",
    "Deepika has never been paired with Salman Khan. Her proximity to Shah Rukh Khan is said to be the reason. Salman shuns actreses who work closely with SRK: Priyanka Chopra, Anushka Sharma, Deepika and other stars.",
    "Deepika's voice which was the highlight of her performance in 'Chennai Express' as dubbed in her debut film 'Om Shanti Om'. Director Farah Khan couldn't see eye to eye with Deepika (so much so that Deepika didn't even visit Farah when her triplets were born). Sources say Farah took revenge by getting someone else to speak for Deepika in her debut film."
  ],
  "Shahrukh Khan": [
    "Studied in St. Columba's school, New Delhi, where he was awarded the 'Sword of Honor', essentially the award for best student.",
    "Although his birth name is spelled Shahrukh, he prefers and signs his name as Shah Rukh.",
    "Hindi megastar.",
    "3 children with Gauri, Aryan, Suhana and AbRam. His 3rd child was born via a surrogate mother on 27 May, 2013.",
    "He agreed to star in Aditya Chopra's films without looking at the script first.",
    "One of the four Khans that ruled Bollywood from the 1990s onwards. The other three are Salman Khan, Saif Ali Khan, and Aamir Khan.SRK joined industry later than Salman and Aamir, Saif is one month senior to SRK as his film Parampara released before Deewana.",
    "Formed a popular screen couple with Kajol and Juhi Chawla.",
    "Runs a production company 'Dreamz Unlimited' with actress, friend, co-star Juhi Chawla and director, friend Aziz Mirza.",
    "Named one of Time Magazine's 20 Asian Heroes under 40. (2004).",
    "His son, Aryan Khan, portrayed SRK as an infant in Kabhi Khushi Kabhie Gham... (2001).",
    "Son, Aryan Khan, voice of Tez Lajawaab (Dash), character for Hindi dubbed version of Disney's animated film, The Incredibles (Hum Hain Lajawaab).",
    "Shah Rukh and his wife, Gauri Khan, own the production company 'Red Chilies Entertainments', which Shah Rukh started for friend and colleague, director/choreographer Farah Khan, for her debut directorial film - Main Hoon Na (2004).",
    "Purchased a villa on a man made island on the coast of Dubai in the United Arab Emirates.",
    "Number 74 on E!'s 101 Hottest Celebrity Bodies Countdown (aired January 2006).",
    "Was not very good at Hindi in school, until his mother promised to take him to the cinema if he passed. As he loved films,he got top marks from then on.",
    "His father ran a transport company and his mother was a magistrate.",
    "Gets along very well with former co-stars Juhi Chawla and Preity Zinta.",
    "Loves computer games, video games and hi-tech gadgets.",
    "His first name 'Shahrukh' means 'face of the king'.",
    "Resides in a mansion called Mannat in Mumbai, India.",
    "Being a Muslim man married to a Hindu woman, he and his wife combine both religious backgrounds into their children's education.",
    "His parents died before he entered movies. Shahrukh considers it a big regret that they couldn't see what their son was to become.",
    "Has a mannequin of himself in Madame Tussaud's Museum in England. Along with Salman Khan, Kareena Kapoor Khan, Sachin Tendulkar, Madhuri Dixit, Amitabh Bachchan, Hrithik Roshan and Aishwarya Rai Bachchan.",
    "He has a dog called Chewbacca.",
    "He has an elder sister named Shehnaz Lalarukh.",
    "Father is Meer Taj Mohammed Khan, Mother is Lateef Fatima Khan.",
    "Fond of BMW cars and owns a number of them including the latest models.",
    "Best friends with Karan Johar, Arjun Rampal,Farhan Akhtar, Saif Ali Khan, Hrithik Roshan and his wife Sussane Khan Roshan, Preity Zinta,Vivek Vaswani,Vivek Oberoi, Juhi Chawla and her husband Jai Metha, Rani Mukerji, Arbaaz Khan, Sajid Khan, Jackie Shroff, Anil Kapoor, Kajol, Malaika Arora , Chunky Pandey and his wife and Mushtaq Sheikh.",
    "Suffers from back, knee and neck problems.",
    "Firmly insists and had promised himself that he would never kiss on the lips of any of his female co-stars after he had done the movie Maya (1993).",
    "Launched Deepika Padukone's career in Bollywood.",
    "His father Meer Mohammed Taj Khan died of cancer in 1981 and his mother Lateef Fatima Khan died of complications in diabetes in 1991.",
    "He has been awarded the Ordre des Arts et des Lettres (Order of the Arts and Literature) award by the French government for his exceptional career.",
    "Launched his perfume 'SK' with the French perfumers and Jeannes Arthes.",
    "The reason why Khan took up mass communications (film making) is because he loved television commercials.",
    "Had Graduated from Hansraj College, Delhi University and followed it up with a Masters Degree in Mass Communications (Film making) from Jamia Millia Islamia University, in New Delhi, but after a year Shah Rukh opted out as he had to make his acting career in Bollywood.",
    "He had captained all teams in football, cricket and hockey and even played cricket at zone and national level.",
    "At school he was an ace in Hindi, electronics and biology but wasn't good at all in mathematics.",
    "His debut film was Dil Aashna Hai (...The Heart Knows) (1992) but due to the delay in the release of the film Deewana (1992) was considered as his debut film.",
    "His acting career in Bollywood was launched by his friend Vivek Vaswani and Hema Malini.",
    "Is very scared of riding horses.",
    "For a short span of time Shahrukh ran a restaurant in Dariya Ganj in New Delhi, India.",
    "SRK joined Barry John's theatre group in New Delhi and learned acting from him, Barry John also taught acting to Manoj Bajpayee in his theatre group.",
    "Owns three Production Houses in India, Dreamz Unlimited, Red Chillies Entertainment and Red Chillies Idiot Box. Red Chillies Idiot Box Production house will start producing Television Serials in India.",
    "Has started producing television serials in India.",
    "Turned down the Quiz Master's (Prem Kapoor) role in Slumdog Millionaire (2008) and the role went to Anil Kapoor.",
    "Owns a VFX company, Red Chillies VFX.",
    "He was the one who recommended Rani Mukerji to Karan Johar for Kuch Kuch Hota Hai and has maintained a close friendship with the actress since.",
    "All time favorite actor of his since his childhood are Dilip Kumar and Rajesh Khanna.",
    "All time favorite actresses are Mumtaz, Sharmila Tagore, Zeenat Aman, Reena Roy, and Saira Banu.",
    "Has done a nude sex scene with his female co-star Deepa Sahi in Maya (1993).",
    "Is a chain cigarette smoker. Smokes at least 2 packs a day.",
    "In 2010, while doing a cameo in Mudassar Aziz's Dulha Mil Gaya (2010), he damaged his shoulder which required him to go through a major surgery.",
    "In 2008, he suffered a major injury on his right shoulder. He ignored the pain, but as it worsened in 2010, he had to undergo a minimal invasive surgery.",
    "While shooting for Shakthi: The Power (2002) in 2001, he suffered a neck injury while performing a stunt. He was operated in the United Kingdom for the same by a renowned surgeon.",
    "On the sets of Darr (1993), he fractured three of his ribs while performing a stunt with Anupam Kher. Kher accidentally lifted his leg, hurting his chest in the process.",
    "Is a huge fan of Manchester United Football Club.",
    "Had recently patched up with his long time arch rival Megastar Salman Khan at an Iftar Party on July 2013.",
    "When he was just four years of age, Shahrukh happened to throw a rock at a neighborhood boy because of which the latter's teeth broke. Late at night that day, the child's father came to the house in an inebriated state while wielding a knife. Shah Rukh's father coolly opened the door and when this man threatened to kill his son for what he had done, he crosschecked with Shah Rukh as to whether or not he had committed the act of mischief. When the child confessed, the dad asked him to go out and explain himself to the man who was not only drunk but also armed. Shah Rukh had to go outside and apologize for his deed.",
    "Loves watching movies alone in the darkness of his BMW car.",
    "Wears his wedding ring on his right hand.",
    "Shahrukh doesn't keep a beard as he and his kids find it scratchy.",
    "He does not like ice creams.",
    "Believes in the TINA factor: There Is No Alternative to hard work.",
    "During his busy schedule, he manages with only 4 to 5 hours of sleep.",
    "He won the Raman Subramanyam Award in Class X (1982-1983) for character, all round performance in studies, sports and extracurricular activities and the Sword of Honour in Class XII (1984-1985) for the Best all round performance, loyalty, obedience, integrity and sportsmanship.",
    "The college where he studied was Delhi University's Hans Raj College, and Shah Rukh did his Economics Honors from the institution between 1985-1988. When Hans Raj celebrated its Golden Jubilee, the college gave away 17 shields to its alumni who had excelled in their lives and professions and Shah Rukh was one of them.",
    "After graduating from Hans Raj, he went on to join Jamia Millia Islamia's Mass Communications Research Centre to do his masters in filmmaking and journalism.",
    "One of the reasons why Shah Rukh bought Mannat, his palatial bungalow, was since he wanted to have an exclusive prayer room. Shah Rukh says that if he were broke, he will sell everything except Mannat.",
    "His dog's names are Dash, Hulk, Kai and Juicy.",
    "Studied at St. Columbas School and he believes that it is the best school in the whole world not because he studied in it, but because he feels they are very disciplined.",
    "As a parent, he likes to believe he is a better father than an actor.",
    "When he is sad he becomes quiet and overcomes it with hugs from his kids.",
    "His philosophy with people is: It's OK if people let you down, their loss not yours."
  ],
  "Saif Ali Khan":[
    "Dil Chahta Hai won a whole lot of awards and marked Saif's coming of age as an actor but when the role was offered to him, he initially rejected it",
    "Saif wasn't the first choice for the lead role in the award winning film, Parineeta. Prior to the shoot of the film, the producer wasn't entirely convinced that Saif could perform in the role. Post the release and success of Parineeta, Vidhu Vinod Chopra collaborated with Saif for 'Eklavya",
    "There were many contenders for the role of Langda Tyagi in Omkara, including Aamir Khan. Saif's audition blew Vishal Bharadwaj away and the rest as they say is history.",
    "Saif wasn't the first choice for the role of Rohit Patel in Kal Ho Na Ho. Abhishek Bachchan and Vivek Oberoi were considered for the role before it was offered to Saif. He won the Filmfare Award for Best Supporting Actor for this role.",
    "Saif won filmfare award for kal ho na ho. ",
    "After his divorce, Saif dated Swiss model, Rosa Catalano, for over three years. However, the model then revealed that Saif didn't tell her about his previous marriage and children and she only learnt of this information when she came to India.",
    "Saif was also involved in an assault on a photographer while shooting Love Aaj Kal. Saif is also alledgedly involved in illegally procuring a high-end car through Hawala.",
    "In 1994, two of his films emerged as the most successful films of the year - Main Khiladi Tu Anari and Yeh Dillagi. In both the films, he shared screen space with Akshay Kumar.",
    "With films like Omkara, Dil Chahta Hai, Parineeta, Saif has proved his brilliance in acting and has also emerged as one of the most iconic and versatile actors of the Hindi film industry.",
    "Akshay and Saif's pairing became popular and directors started casting them together. The duo emerged as the most bankable pair of the decade. Films like Aarzoo, Keemat only strengthened their position in the industry.",
    "Saif Ali Khan's most popular and loved role was the one in Dil Chahta Hai. He played a laid back guy named Sameer who desperately wanted to be in a relationship. The film bagged him several awards.",
    "Very few know that Saif had initially rejected this role in Dil Chahta Hai. It was only after Dimple Kapadia persuaded him, that he agree to play the part. What is even more shocking is that Shiney Ahuja was initially considered for this role",
    "Saif's first wife is Amrita Singh. He has a daughter named Sara Ali Khan and a son named Ibrahim wiith Dimple Kapadia.",
    "Saif even bagged the 'Best Villain' award for his dark yet splendid performance in the Omkara. Aamir Khan was keen to play the role of Langda Tyagi, but it was Saif who finally bagged the role.",
    "Vishal Bharadwaj had asked Saif to shoot for a particular sequence from the movie Omkara, naked. To this Saif had replied, 'I will shoot naked only if you agree to direct it naked.'",
    "Saif Ali Khan married Bollywood actress Amrita Singh when he was very young. The couple tied the knot secretly as Amrita was older to him. He has two children with Amrita - a daughter named Sara and a son named Ibrahim.",
    "Saif and Kareena started dating during the shoot of movie 'Tashan'. ",
    "Saif Ali Khan made the debut with Yash Chopra's Parampara but became successful with films like Main Khiladi Tu Anari and Yeh Dillagi which was two years later from entering the B-World.",
    "Saif Ali khan and Amrita Singh are one of the most unlikely pair in Bollywood. They first met on the sets of Rahul Rawail's film and soon Saif was smitten by the beauty. It didn't take much time for the couple to fall in love with each other",
    "Saif Ali Khan parents were against his and Amrita Singh's marriage and opposed it strongly.",
    "Saif was considered as a  supporting actor after Main khiladi Tu Anadi and Main Chor Tu Sipahi. It was after Kal Ho Na Ho he proved his acting again. "
  ],
  "Diana Penty":[
    "Diana Penty was born in Bombay on November 2nd, 1985 to a Christian mother and a Parsi father. She attended St. Agnes high school in Bombay, and graduated with with a Bachelors degree in Mass Communication from the St. Xavier's University in Bombay.",
    "Penty began modeling in 2005, walking the ramp for Italian designers Trussadi and Ferre during the India-Italy festival in 2006.",
    "With a fresh look and her natural elegance on the ramp, Penty was quickly signed up by Maybelline to replace Deepika Padukone, as the new brand ambassador and the face of Garnier India.",
    "Penty was immediately noticed by several directors from Bollywood, and began receiving offers as early as 2008. However, it was only in 2012, that Penty made the transition to Bollywood, and signed on as the lead in Homi Adajania's 2012 blockbuster, Cocktail, featuring Saif Ali Khan and Deepika Padukone.",
    "Penty's debut breakthrough performance resulted in immediate fame, winning several awards for her role as Meera, a simple Indian girl with traditional values who finds herself in a foreign land, having to start all over again.",
    "Penty continued to model following the success of her film, and turned down several scripts as she wanted to ensure her follow up role maintained a high standard."
  ],
  "Sridevi": [
    "Sridevi has done the maximum number of double roles for a Bollywood heroine  seven of them.",
    "The two of the superstars of the 80s, Sridevi & Amitabh Bachchan were rarely seen together; they worked together in just three films Inquilaab, Akhiri Rasta & Khuda Gawaah. Decades later when Sridevi was making a comeback in 2014 with English Vinglish, Amitabh made a special cameo appearance.",
    "In Yash Chopra's Chandni that she actually got her original voice in Hindi films for the first time.",
    "Sridevi was offered Rangeela, Baaghbaan, Baazigar & Mohabbatein in the first place but refused the roles.",
    "Sridevi was born on August 13, 1963. She was named Shree Amma Yanger Ayyapan upon birth",
    "She lost her father during the shooting of Yash Chopra's Lamhe (1991) in London. She flew home for the last rites and returned to work to shoot a comedy sequence with co-star Anupam Kher.",
    "Sridevi's father was a lawyer and her mother tongue is Telugu",
    "She started her career at the age of four in Thirumugham's devotional film, Thunaivan (1967)",
    "She has also won 5 Filmfare Awards for Best Actress in a leading role",
    "Sridevi made her Hindi film debut as a lead actress in Solva Sawan (1979)",
    "In 2013 Government of India awarded her Padma Shri, the fourth highest civilian honor.",
    "Sridevi did playback for Sadma(1983), Chandni(1989), Garajna (1991), Kshana Kshanam (1991).",
    "Sridevi was the first choice for Indra Kumar's Beta. She was supposed to star opposite Anil Kapoor in the film but declined the offer because she had already done a string of films with the actor.",
    "Sridevi was also considered for a role in Jurassic Park. Steven Spielberg wanted to cast her for a brief role. But she was at the peak of her career in Bollywood then and had rejected the offer",
    "Sridevi was director duo Abbas Mustan's first choice to play the female lead in Baazigar.",
    "When she made her debut in Bollywood, Sridevi was not comfortable talking in Hindi. Her voice was mostly dubbed by Naaz. Rekha had dubbed for her in the film, Aakhiri Raasta. Sridevi dubbed for her dialogues for the first time in Chandni.",
    "13 year old Sridevi played Rajnikanth's step mom in a Tamil movie Moondru Mudichu",
    "Mithun Chakraborty and Sridevi got married very secretly. The marriage did not work well and both got separated.",
    "Because of her dance move was Sridevi was even called as Miss thunder thighs.",
    "Jaya Prada was considered to be Sridevi's strongest contender at that point of time. Their fierce competition was one of the worst kept secrets ever."
  ],
  "Ranveer Singh": [
    "Hrithik Roshan and Fawad Khan were considered for the role of Raja Rawal Ratan Singh. Salman Khan was offered to play the villain but he refused",
    "Unlike Bajirao Masatani 2015.Sanjay Leela Bhansali wanted Salman Khan and Ashwariya Rai for the film many years back .But both the actors weren't in talking terms.Salman Khan agreed to do the film.Ashwariya Rai kept a condition that she would do the film if Salman Khan plays the negative character of Allaudin Khilji as they wont have any scenes together.Salman Khan didn't agree to this condition.",
    "Ranveer Singh locked himself in his apartment for 21 days to get into the character of Alauddin Khilji.",
    "Deepika's first major hit was not Om Shanti Om.",
    "Deepika was supposed to make her debut with Sanjay Leela Bhansali's Saawariya. But Bhansali decided to sign Sonam and Ranbir instead.",
    "She is the first actress ever to have delivered 4 consecutive 100-crore hits.",
    "Himesh Reshammiya gave break to Deepika via his music video titled Naam hai Tera Tera.",
    "Deepika learned acting with Anupam Kher and dancing with Shaimak Davar"
  ]
}